faweiz/FACEBOOKapo/nRF5_SDK_12.1/examples/ble_peripheral/3DPS_UART_SPI16_ADS/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\r\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;
			//	printf("%s",data_array); // print what is send from "PC(COM4:nRF52) to Phone"
            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */

/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
      //  UART_BAUDRATE_BAUDRATE_Baud115200
				UART_BAUDRATE_BAUDRATE_Baud9600
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_advdata_t          scanrsp;
    ble_adv_modes_config_t options;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

//****************** Modified on 1/15/2017 （+SPI) ******************//	
/**
 * @brief SPI user event handler.
 * @param event
 */
void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
    NRF_LOG_INFO("Transfer completed.\r\n");
    if (m_rx_buf[0] != 0)
    {
        NRF_LOG_INFO(" Received: \r\n");
        NRF_LOG_HEXDUMP_INFO(m_rx_buf, strlen((const char *)m_rx_buf));
/* For faster display on phone		
				if(send_value == 0){
					send_incomingValues = incomingValues[0] / (4095/2.5);
// Clear PrintBuffer buffer	
					memset(PrintBuffer,0x00,sizeof(PrintBuffer));
					sprintf((char*) PrintBuffer, "%.3f", send_incomingValues);
// Get data length
					length = strlen((char*)PrintBuffer);	
// Sent data over BLE		
					ble_nus_string_send(&m_nus, PrintBuffer, length);	
				}
*/
    }
}
void SPI_init(){
	LEDS_CONFIGURE(BSP_LED_0_MASK);
    LEDS_OFF(BSP_LED_0_MASK);

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    NRF_LOG_INFO("SPI example\r\n");

    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin   = SPI_SS_PIN;
    spi_config.miso_pin = SPI_MISO_PIN;
    spi_config.mosi_pin = SPI_MOSI_PIN;
    spi_config.sck_pin  = SPI_SCK_PIN;
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));
}
void SPI_Function(uint8_t tx_buf[]){
	// Reset rx buffer and transfer done flag
        memset(m_rx_buf, 0x00, m_length);
        spi_xfer_done = false;

				APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, tx_buf, m_length, m_rx_buf, m_length));

        while (!spi_xfer_done)
        {
            __WFE();
        }

        NRF_LOG_FLUSH();
        LEDS_INVERT(BSP_LED_0_MASK);
        nrf_delay_ms(30); //delay 20 msec
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
	
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
		
    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

		SPI_init();
		 
    // Enter main loop.
		while(1)
    {
		//****************** Modified on 12/20/2016 （UART + SPI_ADC) ******************//
			for(int i=0;i<18;i++)
			{
				for(int j=0; j<2;j++)
				{
					m_tx_buf_ch[j] = m_tx_buf_CH16[i][j];
				}
// Call SPI
				SPI_Function(m_tx_buf_ch);
				if(i>=2)
				{
// changed on 12/19/2016 10:51pm 				
				spi_rx = ((m_rx_buf[0]&0x0F)<<8) | m_rx_buf[1];
				ADC_value = spi_rx;
				voltage_value = ADC_value / (4095/2.5);	
// Debug (If use required to increasing nrf_delay_ms!!!)
//					printf("\n Channel %d \n",i-2);
//					printf(" ADC Value = %d \n",ADC_value);
//					printf(" Voltage = %.3f \n",voltage_value);
//					printf(" spi_rx = %x \n",spi_rx);
//					printf(" m_rx_buf[0] = %d \n",m_rx_buf[0]);
//					printf(" m_rx_buf[1] = %d \n",m_rx_buf[1]);
					incomingValues[i-2] = ADC_value;
				}
				nrf_delay_ms(30); //delay 30 msec
			}
			for(int k=0; k<16;k++)
			{
					if( send_value== k){
						send_incomingValues = incomingValues[k] / (4095/2.5);
// Clear PrintBuffer buffer	
						memset(PrintBuffer,0x00,sizeof(PrintBuffer));
						sprintf((char*) PrintBuffer, "%.3f", send_incomingValues);
// Get data length
						length = strlen((char*)PrintBuffer);	
// Sent data over BLE		
						ble_nus_string_send(&m_nus, PrintBuffer, length);
					}
				printf("%d", incomingValues[k]);
				if(k<16-1) printf(",");
			}
			 printf("\n");
		 power_manage();
    }
}
